TestingTool_3-0/src/Catalogs/РабочиеМеста/РабочиеМеста.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РабочиеМеста</name>
  <attributes>
    <name>ОперационнаяСистема</name>
    <type>
      <types>CatalogRef.ОперационныеСистемы</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяКомпьютера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IPv4</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоСервер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоменноеИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IPv6</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>39</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

TestingTool_3-0/src/CommonModules/РабочееМестоСервер/Module.bsl
// Функция - Создать рабочее место
//
// Параметры:
//  ИмяКомпьютера	 - строка - имя компьютера/сервера
// 
// Возвращаемое значение:
//   - справочник ссылка Рабочие места
//
Функция СоздатьРабочееМесто(Знач ИмяКомпьютера,Знач ОперационнаяСистема=Неопределено) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	РабочееМесто = Справочники.РабочиеМеста.ПустаяСсылка();
	
	Попытка
		РабочееМестоОбъект = Справочники.РабочиеМеста.СоздатьЭлемент();
		РабочееМестоОбъект.Наименование = ИмяКомпьютера;
		РабочееМестоОбъект.ИмяКомпьютера = ИмяКомпьютера;
		РабочееМестоОбъект.ОперационнаяСистема = ОперационнаяСистема;
		РабочееМестоОбъект.Записать();
		РабочееМесто = РабочееМестоОбъект.Ссылка;
	Исключение
		ЗаписьЖурналаРегистрации("Создание рабочего места",УровеньЖурналаРегистрации.Ошибка,Метаданные.Справочники.РабочиеМеста,Неопределено,ОписаниеОшибки());
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);
	Возврат РабочееМесто;
КонецФункции
